OdDAI.Session.deleteNPL(OdDAI.List&lt;OdDAIObjectId&gt;*)
\details
Deletes an instance of Non-Persistent List.

OdDAI.Session.createNPL
\details
Creates an instance of Non-Persistent List.
returns

OdDAI.Session.deleteRepoRecord(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Deletes repository record from the session container.

OdDAI.Session.closeRepo(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Closes an opened repository assigned with this session.

OdDAI.Session.openRepo(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\delete
Opens an unopened repository which exists in the current session.